In [1]:
#Some Useful Methods in Pandas
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,2,3,4],
            index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
s2=s.reindex(["b","d","a","c","e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [4]:
s3=pd.Series(["blue","yellow","purple"],
             index=[0,2,4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [5]:
s3.reindex(range(6),method="ffill")

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [6]:
df=pd.DataFrame(np.arange(9).reshape(3,3),
                index=["a","c","d"],
                columns=["Tim","Tom","Kate"])
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [7]:
df2=df.reindex(["d","c","b","a"])
df2

   Tim  Tom  Kate
d  6.0  7.0   8.0
c  3.0  4.0   5.0
b  NaN  NaN   NaN
a  0.0  1.0   2.0

In [8]:
names=["Kate","Tim","Tom"]
df.reindex(columns=names)

   Kate  Tim  Tom
a     2    0    1
c     5    3    4
d     8    6    7

In [9]:
df.loc[["c","d","a"]]

   Tim  Tom  Kate
c    3    4     5
d    6    7     8
a    0    1     2

In [10]:
s=pd.Series(np.arange(5.),
            index=["a","b","c","d","e"])
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [11]:
new_s=s.drop("b")
new_s

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
s.drop(["c","d"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [13]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                  index=["Kate","Tim",
                         "Tom","Alex"],
                  columns=list("ABCD"))
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [14]:
data.drop("A",axis=1)

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15

In [15]:
data.drop("Kate",axis=0)

       A   B   C   D
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [16]:
data.mean(axis="index")

A    6.0
B    7.0
C    8.0
D    9.0
dtype: float64

In [17]:
data.mean(axis="columns")

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64

In [18]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [19]:
print(s1+s2)

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [20]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

In [21]:
print(df1+df2)

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [22]:
df1.add(df2,fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [23]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [24]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [25]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15